import React, {FC} from 'react';
import {ClipPath, Defs, G, Path, Rect, Svg} from 'react-native-svg';

type TProps = {
  color?: string;
  h?: number;
  w?: number;
};

const FilterIcon: FC<TProps> = ({color = 'white', h = 16, w = 16}) => {
  return (
    <Svg
      id="Groupe_58295"
      data-name="Groupe 58295"
      width={w}
      height={h}
      viewBox="0 0 16 16">
      <Defs>
        <ClipPath id="clip-path">
          <Rect
            id="Rectangle_18801"
            data-name="Rectangle 18801"
            width="16"
            height="16"
            fill={color}
          />
        </ClipPath>
      </Defs>
      <G id="Groupe_58294" data-name="Groupe 58294" clip-path="url(#clip-path)">
        <Path
          id="Tracé_27560"
          data-name="Tracé 27560"
          d="M15.385,1.641H13.448a2.12,2.12,0,0,0-.574-.976,2.239,2.239,0,0,0-3.184,0,2.12,2.12,0,0,0-.574.976H.615a.615.615,0,1,0,0,1.231h8.5a2.12,2.12,0,0,0,.574.976,2.239,2.239,0,0,0,3.184,0,2.12,2.12,0,0,0,.574-.976h1.936a.615.615,0,0,0,0-1.231M12,2.978a1.015,1.015,0,0,1-1.444,0,1.01,1.01,0,0,1,0-1.444,1.01,1.01,0,0,1,1.444,0,1.01,1.01,0,0,1,0,1.444"
          transform="translate(0 0)"
          fill={color}
        />
        <Path
          id="Tracé_27561"
          data-name="Tracé 27561"
          d="M15.385,8.646h-8.5A2.206,2.206,0,0,0,6.31,7.67a2.3,2.3,0,0,0-3.184,0,2.12,2.12,0,0,0-.574.976H.615a.615.615,0,0,0,0,1.231H2.552a2.246,2.246,0,0,0,3.758.976,2.206,2.206,0,0,0,.574-.976h8.5a.615.615,0,0,0,0-1.231M5.44,9.984A1.03,1.03,0,0,1,4,9.984,1.021,1.021,0,1,1,5.44,8.54a1.01,1.01,0,0,1,0,1.444"
          transform="translate(0 -1.262)"
          fill={color}
        />
        <Path
          id="Tracé_27562"
          data-name="Tracé 27562"
          d="M15.385,15.641H13.456a2.318,2.318,0,0,0-.583-.976,2.239,2.239,0,0,0-3.184,0,2.318,2.318,0,0,0-.583.976H.615a.615.615,0,0,0,0,1.231H9.108a2.318,2.318,0,0,0,.583.976,2.239,2.239,0,0,0,3.184,0,2.318,2.318,0,0,0,.583-.976h1.928a.615.615,0,0,0,0-1.231M12,16.978a1.015,1.015,0,0,1-1.444,0,1.01,1.01,0,0,1,0-1.444,1.01,1.01,0,0,1,1.444,0,1.01,1.01,0,0,1,0,1.444"
          transform="translate(0 -2.513)"
          fill={color}
        />
      </G>
    </Svg>
  );
};

export default FilterIcon;
